In [1]:
import numpy as np
import pandas as pd

In [2]:
%config Completer.use_jedi=False

In [3]:
sample=pd.read_csv(r'C:\Users\Laptop EDG\Downloads\HW_4\sample_data.csv')
sample.head(5)

,account_id,ad_id,event_name,timestamp,platform,category_name,region_name,condition_ad_name,price
0,249683985899310273,-159265360436186278,order,2018-05-16 17:33:18.350333,on_behalf,Cars,Đông Bắc Bộ,Mới,267000000.0
1,2753457128963724056,-6487219347028929285,order,2018-05-04 16:03:08.099983,on_behalf,Cars,Đông Bắc Bộ,Mới,399000000.0
2,2753457128963724056,-6487219347028929285,order,2018-05-03 15:13:42.447070,on_behalf,Cars,Đông Bắc Bộ,Mới,399000000.0
3,-4397739266189556976,4054922453976773054,order,2018-05-23 11:15:25.932663,on_behalf,Cars,Hà Nội,Mới,705000000.0
4,-8143274583979068266,3202538754056800998,order,2018-05-15 17:53:01.634923,on_behalf,Cars,Hà Nội,Mới,696000000.0

### 1- How many distinct account_id on each platform?

In [4]:
sample.account_id.nunique()

108990

In [5]:
sample.groupby('platform').account_id.nunique()

platform
android         10789
desktop_web     11910
ios             10773
mobile_web       6154
on_behalf          36
unknown        108990
Name: account_id, dtype: int64

### 2- How many distinct ad_id on each platform?

In [6]:
sample.groupby('platform').ad_id.nunique()

platform
android         130551
desktop_web     144673
ios             144161
mobile_web       40165
on_behalf           82
unknown        3669226
Name: ad_id, dtype: int64

### 3- For each category_name how many ad is advertised?

In [7]:
#C1:
sample.groupby('category_name').ad_id.count()

category_name
Accessories                    121942
Aircon                            275
Bags                            10470
Bed & bedding                     453
Bicycles                        23474
                                ...
Trucks                          52772
Vehicles parts, Accessories     56459
Video games                       662
Washing machine                   202
Watch                           74707
Name: ad_id, Length: 64, dtype: int64

In [8]:
#C2:
sample.category_name.value_counts()

PTY-Houses                       842357
Mobile Phones                    781435
Motorbikes                       528333
PTY-Land                         415120
Computers, Laptops               351123
                                  ...
Other household items 14110         139
Ornamental plant & decoration        41
Other pet                            36
Fan                                  12
Lighting                              9
Name: category_name, Length: 64, dtype: int64

### 4- Give me top 5 category_name having the highest number of ads?

In [9]:
sample.category_name.value_counts().head(5)

PTY-Houses            842357
Mobile Phones         781435
Motorbikes            528333
PTY-Land              415120
Computers, Laptops    351123
Name: category_name, dtype: int64

### 5- Give me top 5 category_name having lowest number of ads?

In [10]:
sample.category_name.value_counts().tail(5)

Other household items 14110      139
Ornamental plant & decoration     41
Other pet                         36
Fan                               12
Lighting                           9
Name: category_name, dtype: int64

### 6- Give me the average price for all distinct ads within each category?

In [11]:
# sao 2 cách ra 2 đáp án khác nhau?

In [12]:
sp=sample.groupby('category_name').agg(count_ad=('category_name','count'), sum_price=('price','sum'))
sp['average_price']=sp['sum_price']/sp['count_ad']
sp

                             count_ad     sum_price  average_price
category_name
Accessories                    121942  1.039012e+12   8.520539e+06
Aircon                            275  1.626300e+09   5.913818e+06
Bags                            10470  8.102638e+11   7.738909e+07
Bed & bedding                     453  6.717700e+08   1.482936e+06
Bicycles                        23474  7.625969e+10   3.248688e+06
...                               ...           ...            ...
Trucks                          52772  3.464918e+13   6.565826e+08
Vehicles parts, Accessories     56459  6.275824e+12   1.111572e+08
Video games                       662  1.438970e+09   2.173671e+06
Washing machine                   202  2.725600e+09   1.349307e+07
Watch                           74707  2.662310e+12   3.563669e+07

[64 rows x 3 columns]

In [13]:
sample.groupby('category_name')[['price']].mean()

                                    price
category_name
Accessories                  8.808542e+06
Aircon                       5.913818e+06
Bags                         8.026387e+07
Bed & bedding                1.482936e+06
Bicycles                     3.262726e+06
...                                   ...
Trucks                       6.693941e+08
Vehicles parts, Accessories  1.141225e+08
Video games                  2.210399e+06
Washing machine              1.349307e+07
Watch                        3.596161e+07

[64 rows x 1 columns]

### 7- Give me the average price for all distinct ads within each region_name?

In [14]:
sample.groupby('region_name')[['price']].mean()

                                     price
region_name
Bình Trị Thừa Thiên Huế       4.143188e+08
Các tỉnh lân cận Hà Nội       3.186963e+08
Cần Thơ - Tây Nam Bộ          4.101916e+08
Hà Nội                        6.645161e+08
Hải Phòng Nam Định Thái Bình  1.573403e+08
Nam Trung Bộ                  9.059112e+08
Quảng Nam Đà Nẵng             9.412990e+08
Thanh Nghệ Tĩnh               2.442715e+08
Tp Hồ Chí Minh                1.302872e+09
Tây Bắc Bộ                    3.616878e+08
Tây Nguyên                    6.075989e+08
Đông Bắc Bộ                   2.312546e+08
Đông Nam Bộ                   7.097406e+08

### 8- Give details of condition_ad_name for all ads within each category? For example, for category cars, how may ads is 'Moi', 'Da su dung', and 'NaN'

In [15]:
# sao output1 chỉ có 57 dòng?

In [72]:
pd.options.display.max_rows=10
sample.pivot_table(values='ad_id',index='category_name',
                   columns='condition_ad_name',aggfunc='count',
                   fill_value=0)

condition_ad_name              Mới  Đã sử dụng
category_name
Accessories                   2412       23379
Aircon                           6         269
Bags                          6635        3816
Bed & bedding                  453           0
Bicycles                      2901       20507
...                            ...         ...
Trucks                       15688       37043
Vehicles parts, Accessories  17202       38963
Video games                     85         330
Washing machine                  0         202
Watch                        27039       47584

[57 rows x 2 columns]

In [17]:
sp2=sample.groupby(['category_name'])
def countna(x):
    return(x.isna().sum())
sp2.agg(NaN_condition=('condition_ad_name',countna))

                             NaN_condition
category_name
Accessories                          96151
Aircon                                   0
Bags                                    19
Bed & bedding                            0
Bicycles                                66
...                                    ...
Trucks                                  41
Vehicles parts, Accessories            294
Video games                            247
Washing machine                          0
Watch                                   84

[64 rows x 1 columns]

### 9 - Which month in 2018 we see the highest number of (distinct ads)?

In [18]:
import datetime as dt

In [19]:
sample['timestamp']=pd.to_datetime(sample['timestamp'])
sample['timestamp'].dt.month.value_counts().head(1)

1    874485
Name: timestamp, dtype: int64

### 10- Compare the distinct ads per hour in September, October, and November? Which month and which hour has top ads?

In [20]:
sample['month_timestamp']=sample['timestamp'].dt.month
sample['hour_timestamp']=sample['timestamp'].dt.hour

In [21]:
sp10=sample[(sample.month_timestamp>8)&(sample.month_timestamp<12)]

In [32]:
#Compare:
sp10_2=sp10.pivot_table(values='ad_id',
                        index='month_timestamp', columns='hour_timestamp',
                        aggfunc='count', fill_value=0,
                        margins=True)
sp10_2

hour_timestamp,0,1,2,3,4,5,6,7,8,9,...,15,16,17,18,19,20,21,22,23,All
month_timestamp,,,,,,,,,,,,,,,,,,,,,
9,1453,641,378,278,324,1423,5105,15948,34236,40947,...,24225,21324,17154,13350,11341,9876,7966,5815,3099,351418
10,1571,746,379,264,331,1214,5602,16854,35585,43892,...,25678,22618,18299,13499,12360,10568,8438,5804,3257,371341
11,1441,601,332,203,604,1160,4731,15674,34282,40891,...,24750,21369,17230,12910,11323,9931,7856,5527,3137,351869
All,4465,1988,1089,745,1259,3797,15438,48476,104103,125730,...,74653,65311,52683,39759,35024,30375,24260,17146,9493,1074628

In [67]:
#Which month?
sp10_3=sp10.groupby('month_timestamp').agg(all_ad_count=('ad_id','count'))
a=sp10_3.max()
sp10_3[sp10_3.all_ad_count==int(a)]

                 all_ad_count
month_timestamp
10                     371341

In [68]:
#Which hour?
sp10_4=sp10.groupby('hour_timestamp').agg(all_ad_count=('ad_id','count'))
b=sp10_4.max()
sp10_4[sp10_4.all_ad_count==int(b)]

                all_ad_count
hour_timestamp
9                     125730